# GetValue Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetPropertyFloatArray..::..GetValue Method
AssetPropertyFloatArray Class See Also
---
Get the value of the property.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public IList<float> GetValue()
```

Visual Basic
---
```text
Public Function GetValue As IList(Of Single)
```

Visual C++
---
```text
public:
IList<float>^ GetValue()
```

# See Also
AssetPropertyFloatArray Class
Autodesk.Revit.DB.Visual Namespace